room = [
    {
        'id': '100455533',
        'name': '自主学习专区B203室',
        'area': '浮山'
    },
    {
        'id': '100455535',
        'name': '考研学习专区B204室',
        'area': '浮山'
    },
    {
        'id': '100455537',
        'name': '网络学习专区B205室',
        'area': '浮山'
    },
    {
        'id': '100455539',
        'name': '信息共享专区B206室',
        'area': '浮山'
    },
    {
        'id': '100455541',
        'name': '二楼A区自修区',
        'area': '浮山'
    },
    {
        'id': '100455543',
        'name': '二楼B区自修区',
        'area': '浮山'
    },
    {
        'id': '100455545',
        'name': '三楼A区自修区',
        'area': '浮山'
    },
    {
        'id': '100455547',
        'name': '三楼B区自修区',
        'area': '浮山'
    },
    {
        'id': '100455549',
        'name': '三楼大厅自修区',
        'area': '浮山'
    }
]